probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
/*
 * Step Sequencer Engine
 *
 * Push-style step sequencer with drum and melodic modes.
 * Uses esp_timer for high-resolution periodic clock.
 * All note output feeds dexed_raw_handle_midi() via the existing MIDI queue.
 */

#include "step_sequencer.h"
#include "launchpad.h"
#include "dexed_raw.h"
#include "tsf_engine.h"
#include "esp32_config.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_timer.h"
#include "esp_log.h"

#include <string.h>

static const char *TAG = "step_seq";

/* ================================================
 * Constants
 * ================================================ */

#define SEQ_DEFAULT_VELOCITY    100
#define SEQ_ACTIVE_NOTES_MAX    32

/* Drum MIDI note table (GM-ish: C2=36 through D#3=51) */
static const uint8_t drum_midi_notes[SEQ_NUM_DRUM_TRACKS] = {
    36, 37, 38, 39, 40, 41, 42, 43,
    44, 45, 46, 47, 48, 49, 50, 51,
};

/* ================================================
 * Harmonic Mode Constants & Lookup Tables
 * ================================================ */

/* Circle of Fifths: index = position on circle, value = semitone from C */
static const uint8_t circle_to_semitone[12] = {
    0,  /* C  - position 0 */
    7,  /* G  - position 1 */
    2,  /* D  - position 2 */
    9,  /* A  - position 3 */
    4,  /* E  - position 4 */
    11, /* B  - position 5 */
    6,  /* F#/Gb - position 6 */
    1,  /* C#/Db - position 7 */
    8,  /* G#/Ab - position 8 */
    3,  /* D#/Eb - position 9 */
    10, /* A#/Bb - position 10 */
    5,  /* F  - position 11 */
};

/* Reverse lookup: semitone to circle position */
static const uint8_t semitone_to_circle[12] = {
    0,  /* C = position 0 */
    7,  /* C# = position 7 */
    2,  /* D = position 2 */
    9,  /* D# = position 9 */
    4,  /* E = position 4 */
    11, /* F = position 11 */
    6,  /* F# = position 6 */
    1,  /* G = position 1 */
    8,  /* G# = position 8 */
    3,  /* A = position 3 */
    10, /* A# = position 10 */
    5,  /* B = position 5 */
};

/* Chord intervals as bitmasks (12 bits for chromatic notes) */
static const uint16_t chord_masks[CHORD_TYPE_COUNT] = {
    0b000010010001,  /* MAJ:  root, M3, P5 */
    0b000010001001,  /* MIN:  root, m3, P5 */
    0b010010010001,  /* DOM7: root, M3, P5, m7 */
    0b010010001001,  /* MIN7: root, m3, P5, m7 */
    0b000001001001,  /* DIM:  root, m3, dim5 */
    0b000100010001,  /* AUG:  root, M3, aug5 */
    0b000010100001,  /* SUS4: root, P4, P5 */
    0b000010000101,  /* SUS2: root, M2, P5 */
};

/* Scale intervals as bitmasks */
static const uint16_t scale_masks[SCALE_TYPE_COUNT] = {
    0b101010110101,  /* MAJOR:      W-W-H-W-W-W-H */
    0b010110101101,  /* MINOR:      W-H-W-W-H-W-W */
    0b010110101011,  /* DORIAN:     W-H-W-W-W-H-W */
    0b010010110101,  /* MIXOLYDIAN: W-W-H-W-W-H-W */
    0b010110011011,  /* PHRYGIAN:   H-W-W-W-H-W-W */
    0b101010110011,  /* LYDIAN:     W-W-W-H-W-W-H */
    0b010101101011,  /* LOCRIAN:    H-W-W-H-W-W-W */
    0b001010010101,  /* PENTA_MAJ:  W-W-m3-W-m3 */
    0b010010101001,  /* PENTA_MIN:  m3-W-W-m3-W */
};

/* Note names for debugging */
static const char* note_names[12] = {
    "C", "C#", "D", "D#", "E", "F", "F#", "G", "G#", "A", "A#", "B"
};

/* Chord type names for debugging */
static const char* chord_type_names[CHORD_TYPE_COUNT] = {
    "maj", "min", "7", "m7", "dim", "aug", "sus4", "sus2"
};

/* ================================================
 * Data Structures
 * ================================================ */

typedef struct {
    uint8_t velocity;   /* 0 = off, 1-127 = on */
} seq_drum_step_t;

typedef struct {
    seq_drum_step_t steps[SEQ_MAX_STEPS];
} seq_drum_track_t;

typedef struct {
    uint8_t notes[SEQ_MAX_NOTES_PER_STEP];
    uint8_t velocities[SEQ_MAX_NOTES_PER_STEP];
    uint8_t note_count;
} seq_melodic_step_t;

typedef struct {
    /* Pattern data */
    seq_drum_track_t    drum_tracks[SEQ_NUM_DRUM_TRACKS];
    seq_melodic_step_t  melodic_steps[SEQ_MAX_STEPS];

    /* Transport */
    seq_mode_t  mode;
    bool        playing;
    int         current_step;   /* 0..num_steps-1, -1 when stopped */
    uint8_t     num_steps;      /* active loop length */

    /* Drum mode UI state */
    uint8_t     selected_drum;
    uint8_t     current_velocity;

    /* Melodic mode UI state */
    uint8_t     base_octave;

    /* Harmonic mode state */
    harmonic_state_t harmonic;

    /* Clock */
    uint16_t    bpm;
    esp_timer_handle_t timer;

    /* Active note tracking for Note Off scheduling */
    struct {
        uint8_t note;
        uint8_t channel;
    } active_notes[SEQ_ACTIVE_NOTES_MAX];
    int active_note_count;

    /* Field mode: currently held notes for proper note-off */
    struct {
        uint8_t note;
        bool    active;
    } field_notes[64];

    /* Circle mode: currently held chord (sustain until toggled off or new chord pressed) */
    struct {
        uint8_t chord_root;
        chord_type_t chord_type;
        bool active;
        bool bar_chord_played;  /* flag to play chord once per bar when sequencer running */
    } held_chord;

    /* Bar chord notes tracking (for legato playback across the entire bar) */
    struct {
        uint8_t note;
        bool active;
    } bar_chord_notes[12];  /* max 12 notes in a chord */
    int bar_chord_note_count;

    /* Chord step sequencer (Circle mode, rows 5-8 → 32 quarter-note steps,
     * laid out the same as the drum grid: row 8 = steps 0-7, row 7 = 8-15,
     * row 6 = 16-23, row 5 = 24-31.  Loops every 4 drum-pattern cycles.) */
    struct {
        uint8_t    chord_root;    /* absolute semitone 0-11 */
        chord_type_t chord_type;
        bool       active;        /* step is programmed */
    } chord_seq_steps[32];
    int chord_seq_step;           /* 0-31 = currently playing quarter step; -1 when stopped */

    /* Last chord manually selected via rows 1-4 (used to populate seq steps) */
    uint8_t      selected_chord_root;
    chord_type_t selected_chord_type;
    bool         has_selected_chord;

    /* Page state */
    uint8_t page;

